---
type: ProjectPosition
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ProjectPosition

`Autodesk.Revit.DB.ProjectPosition` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ProjectPosition | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Angle | — | `public double Angle { get ; set ; }` |
| Property | EastWest | — | `public double EastWest { get ; set ; }` |
| Property | Elevation | — | `public double Elevation { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NorthSouth | — | `public double NorthSouth { get ; set ; }` |